rools = """1. Цель игры:
- Собрать как можно больше еды (яблок);
- Вырасти как можно длиннее;
- Избегать столкновения со стенами и своим хвостом.

2. Управление змейкой:
- Для движения змейки используйте клавиши со стрелками:
    - Вверх;
    - Вниз;
    - Влево;
    - Вправо.
- Змейка движется в направлении, указанном в последний момент нажатия клавиши.

3. Сбор еды:
- После съедения яблока змейка увеличивается в длину.
- Каждое яблоко приносит игроку дополнительные очки.

4. Завершение игры:
- Игра завершается, если змейка сталкивается со стеной или своим хвостом.
- При завершении игры появляется сообщение "Игра окончена" и выбор:
    - начать игру заново;
    - выйти из игры.

5. Новая попытка и выход из игры:
- После завершения игры можно нажать на кнопку "Повторить",
чтобы перезапустить игру и начать заново.
- Также можно нажать на кнопку "Выход", чтобы выйти из игры.

6. Настройка уровня сложности:
- После изменения уровня сложности игры все изменения будут применены для игры
только когда, когда вы запустите новый сеанс игр во вкладке "Играть!";
- Кроме уровней по-умолчанию, можно создать свои условия игры,
нажав в меню выбора сложности кнопку "Настройки";
- Настроить уровень можно во вкладке "Настройки"."""

helps = [
"""
Стандартно - 30. Увеличивая число,
вы уменьшаете размер поля.
""",
"""
Изменение прибавляется к стандартной;
Чтобы получить скорость стандартную,
надо выбрать 0;
больше число - больше скорость,
меньше число - меньше скорость.
""",
"""
Ограничение территории появления яблок;
запрещённая территория считается
в клетках от границы;
вводится толщина запрещённой территории.
""",
"""
Значение, которое уставновлено сейчас.
"""
]